src/InformationRegisters/Обсуждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Обсуждения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОВыдачеВОтделенияМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
						<v8:Type>cfg:CatalogRef.МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбАгрегированииИТрансформацииУпаковокМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСоциальныхГрупп</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОказанияУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Заметки</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыОнлайнЗаписи</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Теги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремени</v8:Type>
						<v8:Type>cfg:DocumentRef.Затраты</v8:Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкаВНалоговую</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭлектронныхПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.НачисленияИУдержанияСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОРозничнойПродажеМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсторияПроверкиИКорректировкиДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеМатериалов</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностей</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодписиЭлектронныхПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.КлючиДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.КурсыЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиСинхронизацииФайлов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КассовыйЧекКоррекции</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелефонныеАппараты</v8:Type>
						<v8:Type>cfg:CatalogRef.НаборыГруппДоступа</v8:Type>
						<v8:Type>cfg:DocumentRef.СогласиеНаОбработкуПерсональныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеНастройкиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНоменклатурыМедицинскихУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.СерийныеНомераСертификатов</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.НаборыСвойств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтзывСогласияНаОбработкуПерсональныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.РассылкиОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеЗубнойФормулы</v8:Type>
						<v8:Type>cfg:CatalogRef.МДЛППрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеВариантыОтчетовРасширений</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОВводеВОборотМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:CatalogRef.Лечения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторДолжностей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтветов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СоциальныеСтатусыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеДня</v8:Type>
						<v8:Type>cfg:CatalogRef.ВерсииРасширений</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимодействий</v8:Type>
						<v8:Type>cfg:CatalogRef.ПараметрыОценки</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ХранилищеШаблонов</v8:Type>
						<v8:Type>cfg:CatalogRef.ТекстовыеШаблоны</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПеремещенииГЛОМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыДополнительныхОтчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПовторномВводеВОборотМДЛП</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОФактеУничтоженияМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ОценкиКачестваЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.РегистраторыМДЛП</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПередачеНаУничтожениеМДЛП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимодействие</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСоциальныхСтатусов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.РассылкаСообщений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрограммыЭлектроннойПодписиИШифрования</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОтгрузкеМДЛП</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОВыбытииМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаРеквизитовОбследований</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеКомпоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПриемкеМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМедицинскихКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.НазначенияСертификатовЭЦП</v8:Type>
						<v8:Type>cfg:CatalogRef.Местоположения</v8:Type>
						<v8:Type>cfg:CatalogRef.СценарииЧатБотов</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПериодыРаботы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
						<v8:Type>cfg:DocumentRef.ХозяйственныеОперации</v8:Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбОтбореОбразцовМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДоговоров</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеНачисленияИУдержания</v8:Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныМагнитныхКарт</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗадолженности</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщенийПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОПеремещенииМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Системный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремениВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ОбсужденияСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры работы с обсуждениями
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныМеханизмы8_3_6() Экспорт

	СисИнфо = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СисИнфо.ВерсияПриложения, "8.3.6.1") >= 0 
		И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать
		Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Формирует Массив структур, содержащий имена и описания пользователей для использования в тексте обсуждений.
// 
// Параметры: Нет
//
// Возвращаемое значение:
//  Массив           - по числу пользователей: 
//   * Пользователь  - эл. справочника Пользователи
//   * Представление - Строка - Наименование пользователя,
//   * Имя 			 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя";
//   * ДляПоиска 	 - Строка - Наименование пользователя сплошной строкой с нижним подчеркиванием, по типу "Фамилия_Имя",
//	 				   в нижнем регистре
Функция МассивОписанийПользователей() Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Наименование КАК Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Наименование = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОписания = Новый Структура;
		СтруктураОписания.Вставить("Пользователь", Выборка.Пользователь);
		СтруктураОписания.Вставить("Представление", Выборка.Представление);
		СтруктураОписания.Вставить("Имя", СтрЗаменить(Выборка.Представление, " ", "_"));
		СтруктураОписания.Вставить("ДляПоиска", НРег(СтруктураОписания.Имя));
		Результат.Добавить(СтруктураОписания);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция СловарьОписанийПользователей() Экспорт
Функция СловарьОписанийПользователей() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь,
	|	Пользователи.Наименование КАК Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Наименование = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОписания = Новый Структура;
		СтруктураОписания.Вставить("Имя", СтрЗаменить(Выборка.Представление, " ", "_"));
		
		СтруктураФИО = Справочники.Контрагенты.ФамилияИмяОтчество(Выборка.Представление);
		номерСловаФИО = 1;
		Для каждого элементФИО Из СтруктураФИО Цикл
			СтруктураОписания.Вставить("ФИО"+номерСловаФИО, элементФИО.Значение);
			номерСловаФИО = номерСловаФИО + 1;
		КонецЦикла;
		
		Для н=1 По 10 Цикл // 10 первых букв слова ФИО для поиска
			Для номерСловаФИО=1 По 3 Цикл // 3 части Представления - отдельные слова ФИО Представления пользователя 
				СловоПоиска = Лев(СтруктураОписания["ФИО"+номерСловаФИО],н);
				СловоПоиска = НРег(СловоПоиска);
				МассивПользователей = Результат.Получить(СловоПоиска);
				Если МассивПользователей = Неопределено Тогда
					МассивПользователей = Новый Массив;
					МассивПользователей.Добавить(СтруктураОписания.Имя);
					Результат.Вставить(СловоПоиска, МассивПользователей);
				ИначеЕсли МассивПользователей.Найти(СтруктураОписания.Имя)=Неопределено Тогда
					МассивПользователей.Добавить(СтруктураОписания.Имя);
					Результат.Вставить(СловоПоиска, МассивПользователей);
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла; 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирует содержимое поля HTML документа, которое отображает обсуждения
// 
// Параметры: 
//  Объект		     - любая ссылка - объект, по которому выводятся данные обсуждений 
//  ЗаПериод		 - Булево - регулирует ограничение показываемых записей. Если ЗаПериод=Истина И
//						число записей обсуждений больше 15, то показываются записи за последние 14 дней
//						от текущей даты
// Возвращаемое значение:
//  Результат        - Строка - содержимое поля HTML документа 
//
Функция ОбсужденияПоОбъекту(Объект, ЗаПериод=Ложь) Экспорт
	
	Результат = 
	"<HTML>
	|<STYLE type=text/css>
    |BODY {
	|	/* Шрифты */ FONT-FAMILY: sans-serif; FONT-SIZE:12px;
    |}
	|</STYLE>
	|<BODY>
	|";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Обсуждения.МоментВремени КАК МоментВремени,
	|	Обсуждения.Комментарий,
	|	Обсуждения.Системный,
	|	Обсуждения.Пользователь
	|ИЗ
	|	РегистрСведений.Обсуждения КАК Обсуждения
	|ГДЕ
	|	Обсуждения.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	// Если больше 15 записей и используем ограничение по периоду, 
	// то показываем данные за последние 2 недели (14 дней)
	Если ЗаПериод = Истина И Выборка.Количество()>15 Тогда
		ЧислоДнейОграничения = 14;
		ДатаОграничения = ТекущаяДата()-3600*24*ЧислоДнейОграничения;
	Иначе
		ДатаОграничения = Дата("00010101");
	КонецЕсли;
	
	// ПредПользователь = Неопределено;
	ПредВремя = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если Выборка.МоментВремени<ДатаОграничения Тогда
			
			Результат = Результат+ "<DIV STYLE=""DISPLAY: BLOCK; WIDTH: 100%;" +СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = ' MARGIN-BOTTOM: 5px; %1"">
			|<DIV STYLE=""WIDTH: 9em; FLOAT: LEFT; COLOR: gray;"">%2</DIV>
			|<DIV STYLE=""WIDTH: 12em; FLOAT: LEFT; COLOR: gray;"">%3</DIV>
			|<DIV STYLE=""MARGIN-LEFT: 21em;"">%4</DIV>
			|</DIV><BR>'"),
			?(Выборка.Системный, "COLOR: gray;", ""),
			"",
			"",
			"<A HREF='ПоказатьВсе'>Показать все</A>");

			Результат = Результат+Символы.ПС;
			
			Прервать;
		КонецЕсли;
		
		ТекстКомментария = СтрЗаменить(Выборка.Комментарий, Символы.ПС, "<BR>");
		ОбновитьПредставлениеОбъектаВНавигационнойСсылке(ТекстКомментария);

		Если НачалоДня(ТекущаяДатаСеанса())=НачалоДня(Выборка.МоментВремени) Тогда
			МоментВремениСтрокой = НСтр("ru = 'Сегодня в '")+Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=ЧЧ:мм'"));
		ИначеЕсли НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1)=НачалоДня(Выборка.МоментВремени) Тогда
			МоментВремениСтрокой = НСтр("ru = 'Вчера в '")+Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=ЧЧ:мм'"));
		Иначе
			МоментВремениСтрокой = Формат(Выборка.МоментВремени, НСтр("ru = 'ДФ=''дд МММ ЧЧ:мм'''"))
		КонецЕсли; 
		Результат = Результат+ "<DIV STYLE=""DISPLAY: BLOCK; WIDTH: 100%;" + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ' MARGIN-BOTTOM: 5px; %1"">
		|<DIV STYLE=""WIDTH: 9em; FLOAT: LEFT; COLOR: gray;"">%2</DIV>
		|<DIV STYLE=""WIDTH: 12em; FLOAT: LEFT; COLOR: gray;"">%3</DIV>
		|<DIV STYLE=""MARGIN-LEFT: 21em;"">%4</DIV>
		|</DIV><BR>'"),
		?(Выборка.Системный, "COLOR: gray;", ""),
		МоментВремениСтрокой,
		HTMLСсылка(Выборка.Пользователь),
		ТекстКомментария);
		Результат = Результат+Символы.ПС;
		ПредВремя = НачалоМинуты(Выборка.МоментВремени);
	КонецЦикла;
	Результат = Результат+"</BODY></HTML>";
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПредставлениеОбъектаВНавигационнойСсылке(ТекстКомментария) Экспорт
	
	Текст = ТекстКомментария;
	
	НачалоСсылки = Найти(Текст, "<A HREF='");
	Пока НачалоСсылки>0 Цикл
		КонецСсылки = Найти(Текст, "'>");
		КонецОбъекта= Найти(Текст, "</A>");
		ОписаниеОбъекта = Сред(Текст, КонецСсылки+2, КонецОбъекта-КонецСсылки-2);
		
		ДлинаСсылки = КонецСсылки - НачалоСсылки;
		НС = Сред(Текст, НачалоСсылки+9, ДлинаСсылки-9);
		Если СокрЛП(НС)="" Тогда
			// Перечисления
			СсылкаОбъекта = ОписаниеОбъекта;
		Иначе
			СсылкаОбъекта = ПолучитьСсылкуИзНавигационной(НС);
		КонецЕсли;
	
		ТекстКомментария = СтрЗаменить(ТекстКомментария, 
				ОписаниеОбъекта,
				Строка(СсылкаОбъекта)
				);
		Текст = Сред(Текст, КонецОбъекта+4, СтрДлина(Текст));
		НачалоСсылки = Найти(Текст, "<A HREF='");
	КонецЦикла; 
	
КонецПроцедуры	

// Добавляет запись обсуждения в регистр сведений Обсуждения для Ссылки, 
// А также для упомянутых (по навигационным ссылкам) в тексте комментария объектов,
// формирует напоминания пользователям, упомянутым в тексте комментария
// Параметры:
//  Комментарий			   Строка 		- текст сообщения
//  Ссылка				   Любая ссылка - ссылка на объект обсуждения
//  МоментВремени          Дата и время - время сохранения сообщения
//  Системный			   Булево 		- Истина для сохранения изменений объекта, Ложь для сохранения комментариев к объекту
//  Пользователь		   Справочник Пользователи - Пользователь, сохраняющий комментарий
//
Процедура ДобавитьСообщение(
	Комментарий, 
	Ссылка, 
	МоментВремени = Неопределено, 
	Системный = Ложь, 
	Пользователь = Неопределено) Экспорт
	
	Если ПустаяСтрока(Комментарий) ИЛИ НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПозовательДляЗаписи	= ?(НЕ ЗначениеЗаполнено(Пользователь), Пользователи.АвторизованныйПользователь(), Пользователь);
	
	ПользователиРассылки= Новый Массив;
	// Заменяем в тексте сообщения навигационные ссылки на HTML-ссылки
	Если НЕ Системный Тогда
		
		ЗаменитьТехническиеСимволы(Комментарий);
		
		МассивСсылокУпоминаний = ПреобразоватьНавигационныеСсылки(Комментарий);
		
		// Записать упоминания других объектов в сообщении, если есть
		Для каждого СсылкаУпоминание Из МассивСсылокУпоминаний Цикл
			КомментарийУпоминание = НСтр("ru = 'Упоминание в: '")+HTMLСсылка(Ссылка);
			ЗаписатьДанные(КомментарийУпоминание, СсылкаУпоминание, МоментВремени, Системный, ПозовательДляЗаписи);
		КонецЦикла;
	КонецЕсли;
	// Заменяем имена пользователей по тегу @ на HTML-ссылки пользователей
	ПреобразоватьСсылкиПользователей(Комментарий, ПользователиРассылки);
	
	// Записать основное сообщение
	ЗаписатьДанные(Комментарий, Ссылка, МоментВремени, Системный, ПозовательДляЗаписи);
	
	// СформироватьНапоминанияПользователям(Ссылка, ПозовательДляЗаписи, Комментарий, ПользователиРассылки);
	
КонецПроцедуры

Процедура ЗаменитьТехническиеСимволы(Комментарий)
	
	Комментарий = СтрЗаменить(Комментарий, "<", "&lt;");
	Комментарий = СтрЗаменить(Комментарий, ">", "&gt;");
	
КонецПроцедуры

Процедура ЗаписатьДанные(Комментарий, Ссылка, МоментВремени, Системный, Пользователь)
	
	Менеджер = РегистрыСведений.Обсуждения.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Ссылка;
	Менеджер.МоментВремени = ?(НЕ ЗначениеЗаполнено(МоментВремени), ТекущаяДатаСеанса(), МоментВремени);
	Менеджер.Комментарий = Комментарий;
	Менеджер.Системный = Системный;
	Менеджер.Пользователь = Пользователь;
	Менеджер.МоментВремениВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Менеджер.Записать(Истина);
	
КонецПроцедуры

#Область ОбработчикиСобытий

// Обновляет содержание обсуждений в форме объекта.
// 
// Параметры:
//  Форма				   - Форма объекта
//  Ссылка				   - Ссылка объекта, для которого будут обновлены обсуждения
Процедура ПослеЗаписиНаСервере(Форма, Ссылка) Экспорт
	
	Если Форма.Элементы.Обсуждение.Родитель<>Неопределено Тогда
		ГруппаОбсужденияИмя = Форма.Элементы.Обсуждение.Родитель.Имя;
		ГруппаСтраницы		= Форма.Элементы.Обсуждение.Родитель.Родитель.Имя;
		Если Форма.Элементы[ГруппаСтраницы].ТекущаяСтраница = Форма.Элементы[ГруппаОбсужденияИмя] Тогда
			Форма.Обсуждение = ОбсужденияПоОбъекту(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Записывает данные об изменениях объекта по подписке на событие.
// 
// Параметры:
//  Источник			   - Ссылка объекта, для которого будут записаны данные обсуждений
//  Отказ				   - Отказ записи
// Дополнительно формируются записи: 
//		при наличии поля "Контрагент" - формируется запись в обсуждениях контрагента об упоминании в этом объекте
//		при вводе на основании - формируется запись о введенном дочернем объекте в обсуждении для родительского объекта
Процедура ОбсужденияПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
	    Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		Если ОбщегоНазначения.ЭтоДокумент(Источник.Метаданные()) Тогда
			Сообщение = ?(Источник.Проведен, НСтр("ru = 'Создан и проведен'"), НСтр("ru = 'Создан'"));
		Иначе
			Сообщение = НСтр("ru = 'Создан'");
		КонецЕсли; 
		
		ДобавитьСообщение(
		Сообщение, 
		Источник.Ссылка,
		, 
		Истина);
		
		ДобавитьЗаписьУпоминаниеКонтрагента(,Источник);
		ДобавитьЗаписьВводНаОсновании(Источник);
		
	КонецЕсли;
	
КонецПроцедуры

// Записывает данные об изменениях объекта по подписке на событие.
// 
// Параметры:
//  Источник			   - Ссылка объекта, для которого будут записаны данные обсуждений
//  Отказ				   - Отказ записи
//  РежимЗаписи			   - Режим записи объекта
//  РежимПроведения		   - Режим проведения объекта
// Если объект новый и еще не сохранен, запись обсуждений передается в процедуру 
// ОбсужденияПриЗаписи, где уже есть ссылка объекта
// В ДополнительныеСвойства передаются параметры: 
//	Модифицированность		- модифицированность объекта в форме
Процедура ОбсужденияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
	    Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
			
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоДокумент(Источник.Метаданные()) Тогда
		Сообщение = ОбсужденияСравнитьОбъектыДокумент(Источник, РежимЗаписи, РежимПроведения);
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(Источник.Метаданные()) Тогда
		Сообщение = ОбсужденияСравнитьОбъектыСправочник(Источник); 
	ИначеЕсли ОбщегоНазначения.ЭтоЗадача(Источник.Метаданные()) Тогда
		Сообщение = ОбсужденияСравнитьОбъектыЗадача(Источник);	
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(Сообщение) Тогда
		ДобавитьСообщение(
		Сообщение, 
		Источник.Ссылка,
		, 
		Истина);
	КонецЕсли; 

КонецПроцедуры

// Обработчик подписки на событие "ОбсужденияПередЗаписьюРегистра"
Процедура ОбсужденияПередЗаписьюРегистраПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
	    Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	// сравниваем старый и новый набор записей и выявляем изменения
	Результат = "";
	СтарыйНабор = ОбщегоНазначенияСтоматология.ПолучитьСтарыйНаборПередЗаписьюРегистра(Источник, Замещение);
	НовыйНабор = Источник;
	
	МетаданныеРегистра = Источник.Метаданные();
	
	// удаление записей
	НовыйНаборТЗ = НовыйНабор.Выгрузить();
	Для Каждого Запись Из СтарыйНабор Цикл 
		Если Не ЕстьЗаписьВНабореЗаписей(Запись, НовыйНаборТЗ) Тогда 
			Результат = МетаданныеРегистра.Синоним + ": " + НСтр("ru = 'Удалены: '") + ПолучитьЗаписьРегистраСтрокой(Запись, МетаданныеРегистра);
			ЗаписатьСообщениеОбсуждения(Запись, Результат);
		КонецЕсли;
	КонецЦикла;
	
	// добавление записей
	СтарыйНаборТЗ = СтарыйНабор.Выгрузить();
	Для Каждого Запись Из НовыйНабор Цикл 
		Если Не ЕстьЗаписьВНабореЗаписей(Запись, СтарыйНаборТЗ) Тогда 
			Результат = МетаданныеРегистра.Синоним + ": " + НСтр("ru = 'Добавлены: '") + ПолучитьЗаписьРегистраСтрокой(Запись, МетаданныеРегистра);
			ЗаписатьСообщениеОбсуждения(Запись, Результат);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект=Неопределено, НовыйОбъект)
	
	Если НЕ ЕстьРеквизитОбъекта("Контрагент", НовыйОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтарыйОбъект=Неопределено  Тогда
		// Вызов из несохраненного документа
		Сообщение = НСтр("ru = 'Добавлен в : '")+HTMLСсылка(НовыйОбъект.Ссылка);
		ДобавитьСообщение(
			Сообщение, 
			НовыйОбъект.Контрагент,, 
			Истина);
	ИначеЕсли СтарыйОбъект.Контрагент<>НовыйОбъект.Контрагент Тогда
		Сообщение = НСтр("ru = 'Добавлен в : '")+HTMLСсылка(НовыйОбъект.Ссылка);
		ДобавитьСообщение(
			Сообщение, 
			НовыйОбъект.Контрагент,, 
			Истина);
		
		Сообщение = НСтр("ru = 'Удален из : '")+HTMLСсылка(СтарыйОбъект.Ссылка);
		ДобавитьСообщение(
			Сообщение, 
			СтарыйОбъект.Контрагент,, 
			Истина);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗаписьВводНаОсновании(Источник)
	
	спДокументовОснований = Новый СписокЗначений;
	
	Если ЕстьРеквизитОбъекта("ДокументОснование", Источник) И ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
		спДокументовОснований.Добавить(Источник.ДокументОснование);
	Иначе
		спДокументовОснований = ПолучитьРодительскийДокумент(Источник.Ссылка);
	КонецЕсли;
	
	Если спДокументовОснований.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	Сообщение = НСтр("ru = 'Использован в: '")+HTMLСсылка(Источник.Ссылка);
	
	Для каждого стр Из спДокументовОснований Цикл
		ДокументОснование = стр.Значение;
		
		ДобавитьСообщение(
			Сообщение, 
			ДокументОснование,, 
			Истина);
	
	КонецЦикла; 
	
КонецПроцедуры

Функция ОбсужденияСравнитьОбъектыСправочник(Источник)
	
	СтарыйОбъект = Источник.Ссылка.ПолучитьОбъект();
	НовыйОбъект = Источник;	
	
	СтруктураРеквизитов = РеквизитыДляПроверкиИзмененийСправочник(Источник.Метаданные().Имя);
	ОписаниеИзменений = "";
	Сообщение = "";
	
	// изменение реквизитов
	ОписаниеИзменений = ОписаниеИзмененийРеквизитов(СтруктураРеквизитов, СтарыйОбъект, НовыйОбъект, ОписаниеИзменений);
	// изменение табличных частей
	ОписаниеИзменений = ОписаниеИзменений + ?(ПустаяСтрока(ОписаниеИзменений), "", Символы.ПС) + ОписаниеИзмененийТабличныхЧастей(СтарыйОбъект, НовыйОбъект);
	
	ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект, НовыйОбъект);
	Если НЕ ПустаяСтрока(ОписаниеИзменений) Тогда
		Сообщение = Сообщение+?(ПустаяСтрока(Сообщение), "", Символы.ПС)+
		ОписаниеИзменений;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции 

Функция ОбсужденияСравнитьОбъектыЗадача(Источник)
	
	СтарыйОбъект = Источник.Ссылка.ПолучитьОбъект();
	НовыйОбъект = Источник;	
	Сообщение = "";
	ОписаниеИзменений = "";
	
	Если Источник.ДополнительныеСвойства.Свойство("Модифицированность") И Источник.ДополнительныеСвойства.Модифицированность=Ложь Тогда
		Возврат Сообщение;
	КонецЕсли;
	
	СтруктураРеквизитов = РеквизитыДляПроверкиИзмененийЗадача(Источник.Метаданные().Имя);
	ОписаниеИзменений	= ОписаниеИзмененийРеквизитов(СтруктураРеквизитов, СтарыйОбъект, НовыйОбъект, ОписаниеИзменений);
	// изменение табличных частей
	ОписаниеИзменений = ОписаниеИзменений + ?(ПустаяСтрока(ОписаниеИзменений), "", Символы.ПС);
		
	Если ОписаниеИзменений="" И Источник.ДополнительныеСвойства.Свойство("Модифицированность") И Источник.ДополнительныеСвойства.Модифицированность=Истина Тогда
		// Изменены реквизиты, не входящие в список для проверки
		ОписаниеИзменений=НСтр("ru = 'Внесены изменения'")
	КонецЕсли;
	
	// ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект, НовыйОбъект);
	
	Если НЕ ПустаяСтрока(ОписаниеИзменений) Тогда
		Сообщение = Сообщение+?(ПустаяСтрока(Сообщение), "", Символы.ПС)+
		ОписаниеИзменений;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

Функция ОбсужденияСравнитьОбъектыДокумент(Источник, РежимЗаписи, РежимПроведения)
	
	СтарыйОбъект = Источник.Ссылка.ПолучитьОбъект();
	НовыйОбъект = Источник;	
	Сообщение = "";
	ОписаниеИзменений = "";
	
	ДобавитьТекстСтандартныхСообщений(Сообщение, СтарыйОбъект, НовыйОбъект, РежимЗаписи, РежимПроведения);
	
	Если Источник.ДополнительныеСвойства.Свойство("Модифицированность") И Источник.ДополнительныеСвойства.Модифицированность=Ложь Тогда
		Возврат Сообщение;
	КонецЕсли;
	
	СтруктураРеквизитов = РеквизитыДляПроверкиИзмененийДокумент(Источник.Метаданные().Имя);
	ОписаниеИзменений	= ОписаниеИзмененийРеквизитов(СтруктураРеквизитов, СтарыйОбъект, НовыйОбъект, ОписаниеИзменений);
	// изменение табличных частей
	ОписаниеИзменений = ОписаниеИзменений + ?(ПустаяСтрока(ОписаниеИзменений), "", Символы.ПС) + ОписаниеИзмененийТабличныхЧастей(СтарыйОбъект, НовыйОбъект);
		
	Если ОписаниеИзменений="" И Источник.ДополнительныеСвойства.Свойство("Модифицированность") И Источник.ДополнительныеСвойства.Модифицированность=Истина Тогда
		// Изменены реквизиты, не входящие в список для проверки
		ОписаниеИзменений=НСтр("ru = 'Внесены изменения'")
	КонецЕсли;
	
	ДобавитьЗаписьУпоминаниеКонтрагента(СтарыйОбъект, НовыйОбъект);
	
	Если НЕ ПустаяСтрока(ОписаниеИзменений) Тогда
		Сообщение = Сообщение+?(ПустаяСтрока(Сообщение), "", Символы.ПС)+
		ОписаниеИзменений;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

Функция РеквизитыДляПроверкиИзмененийДокумент(ДокументНаименование)
	
	Результат = Новый Структура("
	|Дата,
	|Номер,
	|ПометкаУдаления");

	Для Каждого Реквизит Из Метаданные.Документы[ДокументНаименование].Реквизиты Цикл 
		Результат.Вставить(Реквизит.Имя);
	КонецЦикла;   
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыДляПроверкиИзмененийСправочник(СправочникНаименование)
	
	Результат = Новый Структура("
	|ПометкаУдаления,
	|Наименование,
	|Код");
	
	// Скидки наценки
	Для Каждого Реквизит Из Метаданные.Справочники[СправочникНаименование].Реквизиты Цикл 
		Если Реквизит.Имя = "СхемаКомпоновкиДанных" Тогда 
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Реквизит.Имя);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции 

Функция РеквизитыДляПроверкиИзмененийЗадача(ОбъектНаименование)
	
	Результат = Новый Структура("
	|Дата,
	|Номер,     
	|Выполнена,
	|Наименование,
	|ПометкаУдаления");

	Для Каждого Реквизит Из Метаданные.Задачи[ОбъектНаименование].Реквизиты Цикл 
		Результат.Вставить(Реквизит.Имя);
	КонецЦикла;   
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АвтоматическиеСобытия

Процедура ДобавитьТекстСтандартныхСообщений(Сообщение, СтарыйОбъект, НовыйОбъект, РежимЗаписи, РежимПроведения)
	
	Если НЕ СтарыйОбъект.Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Сообщение = НСтр("ru = 'Проведен'");
	КонецЕсли; 
	
	Если СтарыйОбъект.Проведен И РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		Сообщение = НСтр("ru = 'Проведение отменено'");
	КонецЕсли; 
	
	Если НЕ СтарыйОбъект.ПометкаУдаления И НовыйОбъект.ПометкаУдаления Тогда
		Сообщение = НСтр("ru = 'Помечен на удаление'");
	КонецЕсли; 
	
	Если СтарыйОбъект.ПометкаУдаления И НЕ НовыйОбъект.ПометкаУдаления Тогда
		Сообщение = НСтр("ru = 'Снята пометка на удаление'");
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеИзмененийРеквизитов(СтруктураРеквизитов, СтарыйОбъект, НовыйОбъект, ОписаниеИзменений)
	
	МетаданныеОбъекта = НовыйОбъект.Метаданные();
	ОписаниеИзменений = "";
	
	Для каждого Реквизит Из СтруктураРеквизитов Цикл
		Если НЕ ЕстьРеквизитОбъекта(Реквизит.Ключ, НовыйОбъект) И НЕ ЕстьРеквизитОбъекта(Реквизит.Ключ, СтарыйОбъект) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтарыйОбъект[Реквизит.Ключ]=НовыйОбъект[Реквизит.Ключ] Тогда
			Продолжить;
		КонецЕсли;  
		
		Если ТипЗнч(СтарыйОбъект[Реквизит.Ключ]) = Тип("ХранилищеЗначения")Тогда
			
			СтараяСтруктураПараметров = СтарыйОбъект[Реквизит.Ключ].Получить();
			НоваяСтруктураПараметров  = НовыйОбъект[Реквизит.Ключ].Получить();
			
			Если ТипЗнч(СтараяСтруктураПараметров) = Тип("Структура")
				И ТипЗнч(НоваяСтруктураПараметров) = Тип("Структура") Тогда
				
				Для Каждого Строка Из  СтараяСтруктураПараметров Цикл
					
					Если НоваяСтруктураПараметров.Свойство(Строка.Ключ) Тогда
						НовоеЗначение = НоваяСтруктураПараметров[Строка.Ключ];
						
						Если Не ОбщегоНазначения.ДанныеСовпадают(Строка.Значение, НовоеЗначение) Тогда
							
							ТекстСтарыйОбъект = Строка.Значение;
							ТекстНовыйОбъект  = НовоеЗначение;
							
							ОписаниеИзменений = ОписаниеИзменений + ?(ПустаяСтрока(ОписаниеИзменений), "", Символы.ПС) + Строка.Ключ + ": "+ ТекстСтарыйОбъект + " -> " + ТекстНовыйОбъект;
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе 
			
			// Текст описания изменения формируется автоматически
			Синоним = ПредставлениеРеквизита(МетаданныеОбъекта, Реквизит.Ключ);
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтарыйОбъект[Реквизит.Ключ])) 
				ИЛИ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СтарыйОбъект[Реквизит.Ключ]))
				Тогда
				ТекстСтарыйОбъект = HTMLСсылка(СтарыйОбъект[Реквизит.Ключ]);
			Иначе
				ТекстСтарыйОбъект = СтарыйОбъект[Реквизит.Ключ];
			КонецЕсли; 
			Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(НовыйОбъект[Реквизит.Ключ])) 
				ИЛИ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(НовыйОбъект[Реквизит.Ключ]))
				Тогда
				ТекстНовыйОбъект  = HTMLСсылка(НовыйОбъект[Реквизит.Ключ]);
			Иначе
				ТекстНовыйОбъект  = НовыйОбъект[Реквизит.Ключ]
			КонецЕсли; 
			
			ОписаниеИзменений = ОписаниеИзменений+
			?(ПустаяСтрока(ОписаниеИзменений), "", Символы.ПС)+
			Синоним+": "+
			ТекстСтарыйОбъект+" -> "+ТекстНовыйОбъект;  
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеИзменений;
	
КонецФункции

Функция ЕстьРеквизитОбъекта(Знач ИмяРеквизита, Знач Объект)
	ПроверкаРеквизита = Новый Структура(ИмяРеквизита, Неопределено);
	ЗаполнитьЗначенияСвойств(ПроверкаРеквизита, Объект);
	Если ПроверкаРеквизита[ИмяРеквизита] <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ОписаниеСравненияМассивов(МассивСтарыхЗначений, МассивНовыхЗначений)
	
	Результат = "";
	
	СписокДобавленных = Новый СписокЗначений;
	СписокУдаленных = Новый СписокЗначений;
	Для каждого Элемент Из МассивСтарыхЗначений Цикл
		Если МассивНовыхЗначений.Найти(Элемент)=Неопределено И СписокУдаленных.НайтиПоЗначению(Элемент)=Неопределено Тогда
			СписокУдаленных.Добавить(Элемент);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого Элемент Из МассивНовыхЗначений Цикл
		Если МассивСтарыхЗначений.Найти(Элемент)=Неопределено И СписокДобавленных.НайтиПоЗначению(Элемент)=Неопределено Тогда
			СписокДобавленных.Добавить(Элемент);
		КонецЕсли; 
	КонецЦикла;
	
	Если СписокДобавленных.Количество()=0 И СписокУдаленных.Количество()=0 Тогда
		Возврат "";
	КонецЕсли;
	
	Если СписокДобавленных.Количество()>0 И СписокУдаленных.Количество()>0 Тогда
		// Результат = НСтр("ru = 'Удалены: '")+Строка(СписокУдаленных)+", "+НСтр("ru = 'Добавлены: '")+Строка(СписокДобавленных);;
		Результат = Строка(СписокУдаленных)+" -> "+Строка(СписокДобавленных);
		Возврат Результат;
	КонецЕсли; 
	
	Если СписокУдаленных.Количество()>0 Тогда
		Результат = НСтр("ru = 'Удалены: '")+Строка(СписокУдаленных);
	КонецЕсли;
	
	Если СписокДобавленных.Количество()>0 Тогда
		Результат = НСтр("ru = 'Добавлены: '")+Строка(СписокДобавленных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеСравненияТаблиц(ТЧСтарыхЗначений, ТЧНовыхЗначений, СписокКолонокСравнения)
	
	Результат = "";
	
	Для каждого СтрокаТЧ Из ТЧСтарыхЗначений Цикл
		ВремСтруктураПоиска = Новый Структура(СписокКолонокСравнения);
		ЗаполнитьЗначенияСвойств(ВремСтруктураПоиска, СтрокаТЧ);
		СтрокиТЧНовыхЗначений = ТЧНовыхЗначений.НайтиСтроки(ВремСтруктураПоиска);
		Если СтрокиТЧНовыхЗначений.Количество() = 0 Тогда 
			 Результат = Результат + Символы.ПС + НСтр("ru = 'Удалены: '")+ ПреобразоватьСтруктуруВСтроку(ВремСтруктураПоиска, ",");
		КонецЕсли;
	КонецЦикла;
	
	// проверить на сохранение в структуре значений
	Для каждого СтрокаТЧ Из ТЧНовыхЗначений Цикл
		ВремСтруктураПоиска = Новый Структура(СписокКолонокСравнения);
		ЗаполнитьЗначенияСвойств(ВремСтруктураПоиска, СтрокаТЧ);
		СтрокиТЧСтарыхЗначений = ТЧСтарыхЗначений.НайтиСтроки(ВремСтруктураПоиска);
		Если СтрокиТЧСтарыхЗначений.Количество() = 0 Тогда 
			Результат = Результат + Символы.ПС + НСтр("ru = 'Добавлены: '")+ПреобразоватьСтруктуруВСтроку(ВремСтруктураПоиска, ",");
		КонецЕсли; 	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПреобразоватьСсылкиПользователей(Текст, ПользователиРассылки) Экспорт
	
	ОписанияПользователей = МассивОписанийПользователей();
	Для каждого Элемент Из ОписанияПользователей Цикл
		Если Найти(Текст, "@"+Элемент.Имя)=0 Тогда
			Продолжить;
		КонецЕсли;
		Текст = СтрЗаменить(Текст, "@"+Элемент.Имя, HTMLСсылка(Элемент.Пользователь));
		ПользователиРассылки.Добавить(Элемент.Пользователь);
	КонецЦикла; 
	
КонецПроцедуры

Процедура СформироватьНапоминанияПользователям(Ссылка, Комментарий, ПользователиРассылки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ПользовательРассылки Из ПользователиРассылки Цикл
		НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		Основание = ?(ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты"), "из заметок", "из задачи");
		НоваяЗадача.Наименование = "Сформировано автоматически " + Основание;
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.Исполнитель = ПользовательРассылки;
		// НоваяЗадача.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
		// НоваяЗадача.ЗадачаТема = "Сформировано автоматически " + Основание;
		НоваяЗадача.Предмет = Ссылка;
		НоваяЗадача.Автор = ПараметрыСеанса.ТекущийПользователь;
		НоваяЗадача.Описание = ""+ПараметрыСеанса.ТекущийПользователь+": "+УдалитьТеги(Комментарий);
		НоваяЗадача.ДатаНачала = ТекущаяДата();
		// НоваяЗадача.НапоминаниеИспользовать = Истина;
		// НоваяЗадача.ВариантНапоминания = Перечисления.ВариантыНапоминаний.ОтносительноСобытия;
		// НоваяЗадача.ВидВзаимодействия = Перечисления.ВидыВзаимодействия.ЗвонокИсходящий;
		// НоваяЗадача.ЗадачаНазначеннаяДата = ТекущаяДата();
		НоваяЗадача.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеРеквизита(МетаданныеОбъекта, Имя)
	
	Реквизит=МетаданныеОбъекта.Реквизиты.Найти(Имя);
	Если НЕ Реквизит=Неопределено Тогда
		Возврат ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
	КонецЕсли;
	
	Для каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя=Имя Тогда
			Возврат ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Имя;
	
КонецФункции

Функция HTMLСсылка(Ссылка)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	СсылкаСтрокой = Строка(Ссылка);
	СсылкаСтрокой = СтрЗаменить(СсылкаСтрокой, " (не проведен)", "");
	СсылкаСтрокой = СтрЗаменить(СсылкаСтрокой, " (удален)", "");
	
	Возврат "<A HREF='"+ПолучитьНавигационнуюСсылку(Ссылка)+"'>"+СсылкаСтрокой+"</A>";
	
КонецФункции

Функция УдалитьТеги(Текст) Экспорт
	
	Результат = "";
	Остаток = Текст;
	Позиция = Найти(Остаток, "<");
	Пока Позиция>0 Цикл
		Результат = Результат+Лев(Остаток, Позиция-1);
		Остаток = Сред(Остаток, Позиция);
		ПозицияКонца = Найти(Остаток, ">");
		Если ПозицияКонца=0 Тогда
			Остаток = "";
			Прервать;
		КонецЕсли; 
		Тег = Лев(Остаток, ПозицияКонца);
		Если ВРег(Тег)="<BR>" Тогда
			Результат = Результат+Символы.ПС;
		Иначе
			Остаток = Сред(Остаток, ПозицияКонца+1);
		КонецЕсли;
		Позиция = Найти(Остаток, "<");
	КонецЦикла;
	Результат = Результат+Остаток;
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкуИзНавигационной(НС)
	
	ПерваяТочка = Найти(НС, "e1cib/data/");
	ВтораяТочка = Найти(НС, "?ref=");
	ТретьяТочка = Найти(НС, "'>");
	
	ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
	ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
	ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
	Если ТретьяТочка> 0 Тогда
		КонецНС = Прав(НС, СтрДлина(НС) - ТретьяТочка+1);
		ЗначениеСсылки = СтрЗаменить(ЗначениеСсылки, КонецНС, "");
	КонецЕсли;
	Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
КонецФункции

Функция ПолучитьРодительскийДокумент(ДокументСсылка)
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	СписокРеквизитов = Новый СписокЗначений;
	мУжеВСписке = Новый Соответствие;
	
	Для Каждого Реквизит ИЗ МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = Реквизит.Тип.Типы();
		Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
			МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
			
			Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
				 И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
				Попытка
					ЗначениеРеквизита = ДокументСсылка[Реквизит.Имя];
				Исключение
					Прервать;
				КонецПопытки;
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая() И ТипЗнч(ЗначениеРеквизита) = ТекущийТип 
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено И СписокРеквизитов.НайтиПоЗначению(ДокументСсылка[Реквизит.Имя]) = Неопределено Тогда
					Попытка
						СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
					Исключение
						ОтладкаТекстОшибки = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		СтрРеквизитов = "";
		
		Попытка
			СодержимоеТЧ = ДокументСсылка[ТЧ.Имя].Выгрузить();
		Исключение
			Прервать;
		КонецПопытки;
		
		Для Каждого Реквизит ИЗ ТЧ.Реквизиты Цикл
			ТипыРеквизита = Реквизит.Тип.Типы();
			Для Каждого ТекущийТип ИЗ ТипыРеквизита Цикл
				МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТекущийТип);
				Если МетаданныеРеквизита<>Неопределено И Метаданные.Документы.Содержит(МетаданныеРеквизита) 
					И ПравоДоступа("Чтение", МетаданныеРеквизита) Тогда
					СтрРеквизитов = СтрРеквизитов + ?(СтрРеквизитов = "", "", ", ") + Реквизит.Имя;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		СодержимоеТЧ.Свернуть(СтрРеквизитов);
		Для Каждого КолонкаТЧ ИЗ СодержимоеТЧ.Колонки Цикл
			Для Каждого СтрокаТЧ ИЗ СодержимоеТЧ Цикл
				Попытка
					ЗначениеРеквизита = СтрокаТЧ[КолонкаТЧ.Имя];
				Исключение
					Продолжить;
				КонецПопытки;
				МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(ЗначениеРеквизита));
				Если МетаданныеЗначения = Неопределено Тогда
					// базовый тип
					Продолжить;
				КонецЕсли;
				
				ЕСли ЗначениеРеквизита<>Неопределено И НЕ ЗначениеРеквизита.Пустая()
					 И Метаданные.Документы.Содержит(МетаданныеЗначения)
					 И мУжеВСписке[ЗначениеРеквизита] = Неопределено Тогда
					Если СписокРеквизитов.НайтиПоЗначению(ЗначениеРеквизита) = Неопределено Тогда
						Попытка
							СписокРеквизитов.Добавить(ЗначениеРеквизита,Формат(ЗначениеРеквизита.Дата,"ДФ=yyyyMMddЧЧММсс"));
						Исключение
							ОтладкаТекстОшибки = ОписаниеОшибки();
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	возврат СписокРеквизитов;
	
КонецФункции

// Устанавливает функциональную опцию ИспользоватьНапоминанияПользователя=Истина при обновлении версии конфигурации.
// 
// Параметры:
//  СтруктураПараметров    - Структура - Входящие параметры при обновлении
//				ОбработкаЗавершена - Булево - признак окончания процедуры обработки
Процедура ВключитьФОИспользоватьНапоминанияПользователяПриОбновлении(СтруктураПараметров) Экспорт
		
КонецПроцедуры

Функция ПреобразоватьНавигационныеСсылки(Комментарий)
	
	МассивСсылок = Новый Массив;
	МассивНавигационныхСсылок = Новый Массив;
	Остаток = Комментарий;
	Комментарий = "";
	Позиция = Найти(Остаток, "e1cib");
	Пока Позиция>0 Цикл
		Комментарий = Комментарий+Лев(Остаток, Позиция-1);
		Остаток = Сред(Остаток, Позиция);
		Позиция = Найти(Остаток, " ");
		СловоПосле = ?(Позиция=0, Остаток, Лев(Остаток, Позиция-1));
		Остаток = ?(Позиция=0, "", Сред(Остаток, Позиция));
		
		ТретьяТочка = Найти(СловоПосле, "'>");
		Если ТретьяТочка> 0 Тогда
			КонецНС = Прав(СловоПосле, СтрДлина(СловоПосле) - ТретьяТочка+1);
			СловоПослеДляСсылки = СтрЗаменить(СловоПосле, КонецНС, "");
			МассивНавигационныхСсылок.Добавить(СловоПослеДляСсылки);
		Иначе
			МассивНавигационныхСсылок.Добавить(СловоПосле);
		КонецЕсли;
		
		Комментарий = Комментарий+"<A HREF='"+СловоПосле+"'>%"+Формат(МассивНавигационныхСсылок.Количество(), "ЧГ=0")+"</A>";
		СсылкаНаОбъект = ПолучитьСсылкуИзНавигационной(СловоПосле);
		МассивСсылок.Добавить(СсылкаНаОбъект); 
		Позиция = Найти(Остаток, "e1cib");
	КонецЦикла;
	Комментарий = Комментарий+Остаток;  
	ПредставленияСсылок = ПолучитьПредставленияНавигационныхСсылок(МассивНавигационныхСсылок);
	Индекс = ПредставленияСсылок.Количество();
	Пока Индекс>0 Цикл
		Представление = ПредставленияСсылок[Индекс-1].Текст;
		Комментарий = СтрЗаменить(Комментарий, "%"+Формат(Индекс, "ЧГ=0"), Представление);
		Индекс = Индекс-1;
	КонецЦикла;
	
	возврат МассивСсылок;
	
КонецФункции

// Функция получает запись регистра в строковом виде
//
Функция ПолучитьЗаписьРегистраСтрокой(ЗаписьРегистра, МетаданныеРегистра)

	СтрокаЗаписи = "";
	Если МетаданныеРегистра.Ресурсы.Найти("Представление") <> Неопределено Тогда 
		Возврат ЗаписьРегистра.Представление;
	КонецЕсли;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл 
		СтрокаЗаписи = СтрокаЗаписи + ?(ЗначениеЗаполнено(ЗаписьРегистра[Измерение.Имя]), ?(Не ПустаяСтрока(СтрокаЗаписи), ", ", "") + ЗаписьРегистра[Измерение.Имя], "");
	КонецЦикла;
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл 
		СтрокаЗаписи = СтрокаЗаписи + ?(ЗначениеЗаполнено(ЗаписьРегистра[Ресурс.Имя]), ?(Не ПустаяСтрока(СтрокаЗаписи), ", ", "") + ЗаписьРегистра[Ресурс.Имя], "");
	КонецЦикла;
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл 
		СтрокаЗаписи = СтрокаЗаписи + ?(ЗначениеЗаполнено(ЗаписьРегистра[Реквизит.Имя]), ?(Не ПустаяСтрока(СтрокаЗаписи), ", ", "") + ЗаписьРегистра[Реквизит.Имя], "");
	КонецЦикла;

	Возврат СтрокаЗаписи;
	
КонецФункции 

// Функция сравнивает есть ли значения полей строки в наборе записей
//
Функция ЕстьЗаписьВНабореЗаписей(Запись, НаборЗаписейРегистра, СравнениеПоИзмерениям = Истина)
	
	НаборЗаписейРегистраТЗ = ?(ТипЗнч(НаборЗаписейРегистра) = Тип("ТаблицаЗначений"), НаборЗаписейРегистра, НаборЗаписейРегистра.Выгрузить());
	
	СтруктураПоиска = Новый Структура;
	Для Каждого ЭлементКолонки Из НаборЗаписейРегистраТЗ.Колонки Цикл
		СтруктураПоиска.Вставить(ЭлементКолонки.Имя, Запись[ЭлементКолонки.Имя]);
	КонецЦикла;
	
	Возврат НаборЗаписейРегистраТЗ.НайтиСтроки(СтруктураПоиска).Количество() > 0;
	
КонецФункции

// процедура делает запись в регистр Обсуждения
//
Процедура ЗаписатьСообщениеОбсуждения(Запись, Сообщение)
	
	Если ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.ДокументыФизическихЛиц") Тогда 
		ОбъектОбсуждения = Запись.Физлицо;
	ИначеЕсли ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.СтатусыКонтрагентов") Тогда 
		ОбъектОбсуждения = Запись.Контрагент;
	ИначеЕсли ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.ЦеныНоменклатуры") ИЛИ 
		ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.СтатусыНоменклатуры") Тогда 
		ОбъектОбсуждения = Запись.Номенклатура;   
	ИначеЕсли ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.СвязкаПомещениеСотрудник") 
		ИЛИ ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.ВремяРаботыСотрудниковПлан") Тогда 
		ОбъектОбсуждения = Запись.Сотрудник;
	ИначеЕсли ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.НастройкиПользователей") Тогда 
		ОбъектОбсуждения = Запись.Пользователь;
	ИначеЕсли ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.НоменклатураСегмента") 
		Или ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.КонтрагентыСегмента") Тогда 
		ОбъектОбсуждения = Запись.Сегмент;
	ИначеЕсли ТипЗнч(Запись) = Тип("РегистрСведенийЗапись.ДействиеСкидокНаценок") Тогда 	
		ОбъектОбсуждения = Запись.СкидкаНаценка;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Сообщение) Тогда
		ДобавитьСообщение(
		Сообщение, 
		ОбъектОбсуждения,
		, 
		Истина);
	КонецЕсли;  
	
КонецПроцедуры

// Функция возвращает данные структуры в виде строки
//
Функция ПреобразоватьСтруктуруВСтроку(Структура, Разделитель)

	СтрокаРезультат = "";
	Для Каждого ЭлементСтруктуры Из Структура Цикл   
		СтрокаРезультат = СтрокаРезультат + ?(ЗначениеЗаполнено(ЭлементСтруктуры.Значение), ?(Не ПустаяСтрока(СтрокаРезультат), Разделитель + " ", "") + ЭлементСтруктуры.Значение, ""); 
	КонецЦикла;
	Возврат СтрокаРезультат;
	
КонецФункции 

// Функция сравнивает переданные табличные части и возвращает описание изменений строкой
//
Функция ОписаниеИзмененийТабличныхЧастей(СтарыйОбъект, НовыйОбъект)

	ОписаниеИзменений = "";
	Если ОбщегоНазначения.ЭтоДокумент(СтарыйОбъект.Метаданные()) Тогда
		МетаданныеОбъекта = Метаданные.Документы;
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(СтарыйОбъект.Метаданные()) Тогда
		МетаданныеОбъекта = Метаданные.Справочники;
	КонецЕсли; 
	
	Для Каждого ТЧ Из МетаданныеОбъекта[СтарыйОбъект.Метаданные().Имя].ТабличныеЧасти Цикл 
		СтараяТЧ = СтарыйОбъект[ТЧ.Имя];
		НоваяТЧ = НовыйОбъект[ТЧ.Имя];
		
		Если ТЧ.Имя = "КонтактнаяИнформация" Тогда 
			МассивСтарыхЗначений = СтараяТЧ.ВыгрузитьКолонку("Представление");
			МассивНовыхЗначений = НоваяТЧ.ВыгрузитьКолонку("Представление"); 
			Текст = ОписаниеСравненияМассивов(МассивСтарыхЗначений, МассивНовыхЗначений);
		Иначе 
			СписокКолонокСравнения = "";
			Для Каждого КолонкаТаблицы Из ТЧ.Реквизиты Цикл
				Если КолонкаТаблицы.Имя = "КлючСтроки" Тогда 
					Продолжить; 
				КонецЕсли;
				СписокКолонокСравнения = СписокКолонокСравнения + ?(СписокКолонокСравнения<>"", ",", "") + КолонкаТаблицы.Имя;
			КонецЦикла;				
			Текст = ОписаниеСравненияТаблиц(СтараяТЧ, НоваяТЧ, СписокКолонокСравнения);
		КонецЕсли;
	
		Если НЕ ПустаяСтрока(Текст) Тогда
			ОписаниеИзменений = ОписаниеИзменений+ ?(ПустаяСтрока(ОписаниеИзменений), "", Символы.ПС)+ ТЧ.Синоним + ": " +Текст + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеИзменений;
КонецФункции 

#КонецОбласти
